package com.focustech.focus3d.furniture.restful.constant;

import java.util.HashMap;
import java.util.Map;
/**
 * 
 * *
 * @author lihaijun
 *
 */
public class ProvinceCityConst {
	public static String[] province = new String[]{"全国", "北京","天津","河北","山西","内蒙古","辽宁","吉林","黑龙江","上海","江苏","浙江","安徽","福建","江西","山东","河南","湖北","湖南","广东","广西","海南","重庆","四川","贵州","云南","西藏","陕西","甘肃","青海","宁夏","新疆","香港","澳门","台湾","其他"};
	public static Map<String, String[]> province_city = new HashMap<String, String[]>();
	static {
		province_city.put("city_0", new String[]{""});
		province_city.put("city_1", new String[]{"北京","东城","西城","崇文","宣武","朝阳","丰台","石景山"," 海淀","门头沟","房山","通州","顺义","昌平","大兴","怀柔","平谷","密云县","延庆县","其他"});
		province_city.put("city_2", new String[]{"和平","河东","河西","南开","红桥","塘沽","汉沽","大港","西青","津南","武清","蓟县","宁河县","静海县","其他"});
		province_city.put("city_3", new String[]{"石家庄","张家口","承德","秦皇岛","唐山","廊坊","衡水","沧州","邢台","邯郸","保定","其他"});
		province_city.put("city_4", new String[]{"太原","朔州","大同","长治","晋城","忻州","晋中","临汾","吕梁","运城","其他"});
		province_city.put("city_5", new String[]{"呼和浩特","包头","赤峰","呼伦贝尔","鄂尔多斯","乌兰察布","巴彦淖尔","兴安盟","阿拉善盟","锡林郭勒盟","其他"});
		province_city.put("city_6", new String[]{"沈阳","朝阳","阜新","铁岭","抚顺","丹东","本溪","辽阳","鞍山","大连","营口","盘锦","锦州","葫芦岛","其他"});
		province_city.put("city_7", new String[]{"长春","白城","吉林","四平","辽源","通化","白山","延边","其他"});
		province_city.put("city_8", new String[]{"哈尔滨","七台河","黑河","大庆","齐齐哈尔","伊春","佳木斯","双鸭山","鸡西","大兴安岭","牡丹江","鹤岗","绥化 ","其他"});
		province_city.put("city_9", new String[]{"黄浦","卢湾","徐汇","长宁","静安","普陀","闸北","虹口","杨浦","闵行","宝山","嘉定","浦东新","金山","松江","青浦","南汇","奉贤","崇明县","其他"});
		province_city.put("city_10", new String[]{"南京","徐州","连云港","宿迁","淮安","盐城","扬州","泰州","南通","镇江","常州","无锡","苏州","其他"});
		province_city.put("city_11", new String[]{"杭州","湖州","嘉兴","舟山","宁波","绍兴","衢州","金华","台州","温州","丽水","其他"});
		province_city.put("city_12", new String[]{"合肥","宿州","淮北","亳州","阜阳","蚌埠","淮南","滁州","马鞍山","芜湖","铜陵","安庆","黄山","六安","巢湖","池州","宣城","其他"});
		province_city.put("city_13", new String[]{"福州","南平","莆田","三明","泉州","厦门","漳州","龙岩","宁德","其他"});
		province_city.put("city_14", new String[]{"南昌","九江","景德镇","鹰潭","新余","萍乡","赣州","上饶","抚州","宜春","吉安","其他"});
		province_city.put("city_15", new String[]{"济南","聊城","德州","东营","淄博","潍坊","烟台","威海","青岛","日照","临沂","枣庄","济宁","泰安","莱芜","滨州","菏泽","其他"});
		province_city.put("city_16", new String[]{"郑州","三门峡","洛阳","焦作","新乡","鹤壁","安阳","濮阳","开封","商丘","许昌","漯河","平顶山","南阳","信阳","周口","驻马店","其他"});
		province_city.put("city_17", new String[]{"武汉","十堰","襄樊","荆门","孝感","黄冈","鄂州","黄石","咸宁","荆州","宜昌","随州","恩施土家族苗族自治州","仙桃","天门","潜江","神农架林","其他"});
		province_city.put("city_18", new String[]{"长沙","张家界","常德","益阳","岳阳","株洲","湘潭","衡阳","郴州","永州","邵阳","怀化","娄底","湘西","其他"});
		province_city.put("city_19", new String[]{"广州","清远","韶关","河源","梅州","潮州","汕头","揭阳","汕尾","惠州","东莞","深圳","珠海","中山","江门","佛山","肇庆","云浮","阳江","茂名","湛江","其他"});
		province_city.put("city_20", new String[]{"南宁","桂林","柳州","梧州","贵港","玉林","钦州","北海","防城港","崇左","百色","河池","来宾","贺州","其他"});
		province_city.put("city_21", new String[]{"海口","三亚","其他"});
		province_city.put("city_22", new String[]{"渝中","大渡口","江北","沙坪坝","九龙坡","南岸","北碚","万盛","双桥","渝北","巴南","万州","涪陵","黔江","长寿","合川","永川","江津","南川","綦江县","潼南县","铜梁县","大足县","璧山县","垫江县","武隆县","丰都县","城口县","开县","巫溪县","巫山县","奉节县","云阳县","忠县","石柱县","彭水","酉阳","秀山","其他"});
		province_city.put("city_23", new String[]{"成都","广元","绵阳","德阳","南充","广安","遂宁","内江","乐山","自贡","泸州","宜宾","攀枝花","巴中","资阳","眉山","雅安","阿坝","甘孜","凉山","其他"});
		province_city.put("city_24", new String[]{"贵阳","六盘水","遵义","安顺","毕节","铜仁","黔东","黔南","黔西","其他"});
		province_city.put("city_25", new String[]{"昆明","曲靖","玉溪","保山","昭通","丽江","普洱","临沧","宁德","德宏","怒江","楚雄","红河","文山","大理","迪庆","西双版纳","其他"});
		province_city.put("city_26", new String[]{"拉萨","那曲","昌都","林芝","山南","日喀则","阿里","其他"});
		province_city.put("city_27", new String[]{"西安","延安","铜川","渭南","咸阳","宝鸡","汉中","安康","商洛","其他"});
		province_city.put("city_28", new String[]{"兰州 ","嘉峪关","金昌","白银","天水","武威","酒泉","张掖","庆阳","平凉","定西","陇南","临夏","甘南","其他"});
		province_city.put("city_29", new String[]{"西宁","海东","海北","黄南","玉树","海南","果洛","海西","其他"});
		province_city.put("city_30", new String[]{"银川","石嘴山","吴忠","固原","中卫","其他"});
		province_city.put("city_31", new String[]{"乌鲁木齐","克拉玛依","喀什","阿克苏","和田","吐鲁番","哈密","塔城","阿勒泰","克孜勒苏","博尔塔拉","昌吉", "伊犁","巴音郭楞","河子","阿拉尔","五家渠","图木舒克","其他"});
		province_city.put("city_32", new String[]{"香港","其他"});
		province_city.put("city_33", new String[]{"澳门","其他"});
		province_city.put("city_34", new String[]{"台湾","其他"});
		province_city.put("city_35", new String[]{"其他"});
	}
}
